In [1]:
# Import dependencies
import sqlite3
import pandas as pd
import numpy as np
from numpy import nan

In [2]:
# Connect to database
conn = sqlite3.connect('database.sqlite')

In [3]:
# Read sqlite query results into a pandas DataFrame
test_df = pd.read_sql_query("""
SELECT 
*
FROM east_central_table

where category not in ('totals')

union

SELECT 
*
FROM north_east_table

where category not in ('totals')

union

SELECT 
*
FROM pacific_table

where category not in ('totals')

union

SELECT 
*
FROM south_table

where category not in ('totals')

union

SELECT 
*
FROM south_east_table

where category not in ('totals')

union

SELECT 
*
FROM south_west_table

where category not in ('totals')

union

SELECT 
*
FROM west_central_table

where category not in ('totals')

""",conn)

# Drop na and first 3 columns
test_df = test_df.drop(test_df.columns[[0]], axis=1)

test_df.head()

     category gender    age  year      division  population
0  video_game   Male  18-24  2013  east_central          26
1  video_game   Male  18-24  2013       pacific          62
2  video_game   Male  18-24  2013         south          61
3  video_game   Male  18-24  2013    south_east          23
4  video_game   Male  18-24  2013    south_west          38

In [4]:
# Save clean data to csv
test_df.to_csv('test_data/test_data.csv', index = False)